% A: 判断矩阵
% Lmax: A的最大特征值
% CI: 一致性指标
% CR: 一致性指标比率
% W: 权重向量

clc, clear all, close all;

% 内置随机一致性指标(矩阵阶数小于17)
RI_Vec = [0, 0, 0.51, 0.89, 1.12, 1.26, 1.36, 1.41, 1.46, 1.49, 1.52, 1.54, 1.56, 1.58, 1.59, 1.6];

A = [1, 1/3, 3;
     3, 1, 5;
     1/3, 1/5, 1];
B1 = [1, 1/3, 1/2, 1, 9, 8, 2;
      3, 1, 2, 3, 9, 9, 4;
      2, 1/2, 1, 1, 9, 9, 2;
      1, 1/3, 1, 1, 9, 8, 2;
      1/9, 1/9, 1/9, 1/9, 1, 1/9, 1/9;
      1/8, 1/9, 1/9, 1/8, 9, 1, 1/5;
      1/2, 1/4, 1/2, 1/2, 9, 5, 1];
B2 = [1, 9, 9, 9, 9, 9, 9;
      1/9, 1, 1, 1, 1, 1, 1;
      1/9, 1, 1, 3, 3, 3, 3;
      1/9, 1, 1/3, 1, 1, 1, 1;
      1/9, 1, 1/3, 1, 1, 1, 1;
      1/9, 1, 1/3, 1, 1, 1, 1;
      1/9, 1, 1/3, 1, 1, 1, 1];
B3 = [1, 9, 3, 9, 3, 9, 9;
      1/9, 1, 1/9, 1, 1/6, 1, 5;
      1/3, 9, 1, 7, 1, 5, 9;
      1/9, 1, 1/7, 1, 1/9, 1, 3;
      1/3, 6, 1, 9, 1, 6, 7;
      1/9, 1, 1/5, 1, 1/6, 1, 5;
      1/9, 1/5, 1/9, 1/3, 1/7, 1/5, 1];

[LA, CIA, CRA, WA] = AHP(A);
[L1, CI1, CR1, W1] = AHP(B1);
[L2, CI2, CR2, W2] = AHP(B2);
[L3, CI3, CR3, W3] = AHP(B3);
WAC = [WA(1), WA(2), WA(3)]; 

CIj = [CI1, CI2, CI3];
RIj = [RI_Vec(7), RI_Vec(7), RI_Vec(7)];
Wj = [W1, W2, W3];
CR = (WAC .* CIj)/(WAC .* RIj);
if CR < 0.1
    disp('层次总排序的一致性可接受')
    Y = Wj * WA;
else
    disp('层次总排序的一致性不可接受')
end

%% 合理性判断函数
function [Lmax, CI, CR, W] = AHP(OUT)

% 矩阵A方阵判断
[m, n] = size(OUT); 
if m ~= n
    warning('判断矩阵应为方阵')
    return
end

% 矩阵A正反负矩阵判断
id = tril(true(m), -1);
aij = OUT(id);
B = OUT';
bij = B(id);
if any(aij.*bij ~= 1)
    warning('判断矩阵应为正负反矩阵')
    return
end

% 检验
[V, L] = eig(OUT, 'vector');
L = real(L);
[Lmax, id] = max(L);
RI_Vec = [0, 0, 0.51, 0.89, 1.12, 1.26, 1.36, 1.41, 1.46, 1.49, 1.52, 1.54, 1.56, 1.58, 1.59, 1.6];
RI = RI_Vec(m);
CI = (Lmax - m)/(m - 1);
CR = CI/RI;
W = V(:, id);
W = W/sum(W);
if CR < 0.1
    disp('通过一致性检验')
else
    disp('未通过一致性检验')
end

end



